















print(ord('H'))
print(ord('f'))
print(chr(45))
print(chr(117))
#######################################
##ASCII-код символу
##Зчитайте зі стандартного вводу символ і виведіть його код.
##Програма отримує на вхід один символ із кодом від 33 до 126.
##Ввід Вивід
#A 65

s=input()
print(ord(s))

#######################################

##Символ з даним ASCII-кодом
##Зчитайте зі стандартного вводу ціле число і виведіть ASCII-символ з таким кодом.
##Розв'яжіть цю задачу з використанням тільки однієї змінної типу int.
##Програма одержує на вхід число від 33 до 126.
##Ввід Вивід
##65 A
d=int(input())
print(chr(d))

#######################################
##Таблиця ASCII
##Виведіть усі символи ASCII з кодами від 33 до 126 та їх коди у такому вигляді:
##Вивід
##! 33
##" 34
### 35
##...
##} 125
##~ 126
##for i in range(33,127):
##    print(chr(i), i)
######################################

##Символи в заданому інтервалі
##Виведіть поспіль, без пробілів, усі символи, що лежать у таблиці ASCII між двома
##заданими символами.
##Програма отримує на вхід два символи, кожен в окремому рядку і має вивести рядок,
##що починається першим із заданих символів і закінчується другим.
##Ввід Вивід
##A
##D
##ABCD
##
##0
##9
##0123456789
##a=input()
##b=input()
##for i in range(ord(a),ord(b)+1):
##    print(chr(i),end='')
#####################################
##IsDigit
##Для даного символу, зчитаного зі стандартного вводу, перевірте, чи є він цифрою.
##Програма повинна вивести слово YES, якщо символ є цифрою, або NO.
##Рішення оформіть у вигляді функції IsDigit(c), яка повертає значення типу bool. У
##рішенні не можна використовувати цикли. У рішенні не можна використовувати
##константи з неочевидним значенням типу 48 або 57.
##Ввід Вивід
##0 YES
##A NO
#Variant 1
##c=input()
##def IsDigit(c):
##    return '0'<=c<='9'
##if IsDigit(c):
##    print('YES')
##else:
##    print('NO')
#Variant 2
##c=input()
##def IsDigit(c):
##    return c.isdigit()
##if IsDigit(c):
##    print('YES')
##else:
##    print('NO')
#Variant 3
##c=input()
##def IsDigit(c):
##    return 48<=ord(c)<=57
##if IsDigit(c):
##    print('YES')
##else:
##    print('NO')
#Variant 4
##c=input()
##def IsDigit(c):
##    return chr(48)<=c<=chr(57)
##if IsDigit(c):
##    print('YES')
##else:
##    print('NO')
#########################################
##ToUpper
##Напишіть функцію ToUpper(c), яка переводить символ у верхній регістр, тобто для
##малої літери латинського алфавіту повертає відповідну заголовну букву латинського
##алфавіту, а для інших символів повертає той самий символ.
##Зчитайте один символ зі стандартного вводу та переведіть його у верхній регістр. У
##рішенні не можна використовувати цикли. У рішенні не можна використовувати
##константи з неочевидним значенням.
##Ввід Вивід
##f F
##F F
##4 4

c=input()
def ToUpper(c):
   if c.isalpha():
       return c.lower()
   else:
       return c
print(ToUpper(c))