
# 1) Задача «Робимо зрізи»
# Умова
# Дан рядок.
# Спочатку виведіть третій символ цього рядка.
# У другому рядку виведіть передостанній символ цього рядка.
# У третьому рядку виведіть перші п&#39;ять символів цього рядка.
# У четвертому рядку виведіть весь рядок, крім двох останніх символів.
# У п&#39;ятому рядку виведіть усі символи з парними індексами (вважаючи, що індексація
# починається з 0, тому символи виводяться з першого).
# У шостому рядку виведіть усі символи з непарними індексами, тобто, починаючи з
# другого символу рядка.
# У сьомому рядку виведіть усі символи у зворотному порядку.
# У восьмому рядку виведіть усі символи рядка через один у зворотному порядку,
# починаючи з останнього.
# У дев&#39;ятому рядку виведіть довжину цього рядка.

#solution 

s = input()

# 1
print(s[2])

# 2
print(s[-2])

# 3
print(s[:5])

# 4
print(s[:-2])

# 5
print(s[::2])

# 6
print(s[1::2])

# 7
print(s[::-1])

# 8
print(s[::-2])

# 9
print(len(s))











# 4) Задача «Переставити два слова»
# Умова
# Дано рядок, що складається з двох слів, розділених пробілом. Переставте ці слова
# місцями. Результат запишіть у рядок і виведіть рядок, що вийшов.

# При вирішенні цього завдання не варто користуватися циклами та інструкцією if.



# Рішення
# s = input()

# a, b, c = s.split()

# print(c, b, a)

# 6) Задача «Друге входження»
# Умова
# Дано рядок. Знайдіть у цьому рядку друге входження літери f і виведіть індекс цього
# входження. Якщо літера f у цьому рядку зустрічається лише один раз, виведіть число -
# 1, а якщо не зустрічається жодного разу, виведіть число -2.

# Рішення
# s = input()

# a = s.find('f')
# b = s.find('f', a + 1)

# if a == -1:
#     print(-2)
#     print("Літера f не зустрічається у рядку")
# elif b == -1:
#     print(1)
#     print("Є тільки одне входження літери f")
# else:
#     print(b)
